package model

var AliasMapping = map[string]string{
	"主导": "主导",
	"ZD": "主导",
	"zd": "主导",

	"中车": "中车",
	"ZC": "中车",
	"zc": "中车",

	"广南":        "广州南",
	"广州南":       "广州南",
	"GZN":       "广州南",
	"gzn":       "广州南",
	"GZ":        "广州南",
	"gz":        "广州南",
	"guangzhou": "广州南",

	"北京北": "北京北",
	"北京":  "北京北",
	"BJB": "北京北",
	"BJ":  "北京北",
	"bjb": "北京北",
	"bj":  "北京北",
	"延庆":  "延庆",

	"济南东": "济南东",
	"济南":  "济南东",
	"JND": "济南东",
	"jnd": "济南东",
	"JN":  "济南东",
	"jn":  "济南东",

	"无锡2":    "无锡二号线",
	"无锡":     "无锡二号线",
	"无锡地铁":   "无锡二号线",
	"WX":     "无锡二号线",
	"WXDT":   "无锡二号线",
	"wx":     "无锡二号线",
	"wxdt":   "无锡二号线",
	"无锡二号线":  "无锡二号线",
	"wuxi":   "无锡二号线",
	"无锡4":    "无锡四号线",
	"WXDT4":  "无锡四号线",
	"wxdt4":  "无锡四号线",
	"wuxi4":  "无锡四号线",
	"无锡四号线":  "无锡四号线",
	"无锡4号线":  "无锡四号线",
	"WX4":    "无锡四号线",
	"WX四":    "无锡四号线",
	"徐州2":    "徐州二号线",
	"徐州2号线":  "徐州二号线",
	"徐州二号线":  "徐州二号线",
	"徐州二":    "徐州二号线",
	"xuzhou": "徐州二号线",
	"XZDT2":  "徐州二号线",
	"长沙":     "长沙",
	"CS":     "长沙",
	"cs":     "长沙",

	"西安": "西安",

	"怀化":      "怀化",
	"HH":      "怀化",
	"hh":      "怀化",
	"huaihua": "怀化",
	"HuaiHua": "怀化",
	"HUAIHUA": "怀化",

	"JS":       "精扫",
	"js":       "精扫",
	"KS":       "快扫",
	"ks":       "快扫",
	"精扫":       "精扫",
	"accurate": "精扫",
	"快扫":       "快扫",
	"rapid":    "快扫",
	"360":      "360",
}

var DeploymentMapping = map[string]string{
	"WXDT": "WXDT",
	"GZN":  "GuangZhou",
}

var ConvertMapping = map[string]string{
	"精扫":       "accurate",
	"快扫":       "rapid",
	"360":      "360",
	"accurate": "精扫",
	"rapid":    "快扫",
}
